Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm33/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Port1_MII_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: ECAT, signal: 'PT1_TXD, 1', pin_signal: GPIO_EMC_B1_26}
  - {pin_num: J3, peripheral: ECAT, signal: 'PT1_TXD, 0', pin_signal: GPIO_EMC_B1_27}
  - {pin_num: F5, peripheral: ECAT, signal: PT1_TX_EN, pin_signal: GPIO_EMC_B1_28}
  - {pin_num: E4, peripheral: ECAT, signal: PT1_TX_CLK, pin_signal: GPIO_EMC_B1_29}
  - {pin_num: H2, peripheral: ECAT, signal: 'PT1_RXD, 0', pin_signal: GPIO_EMC_B1_30}
  - {pin_num: J2, peripheral: ECAT, signal: 'PT1_RXD, 1', pin_signal: GPIO_EMC_B1_31}
  - {pin_num: J1, peripheral: ECAT, signal: PT1_RX_DV, pin_signal: GPIO_EMC_B1_32}
  - {pin_num: K1, peripheral: ECAT, signal: PT1_RX_ER, pin_signal: GPIO_EMC_B1_33}
  - {pin_num: L2, peripheral: ECAT, signal: 'PT1_RXD, 2', pin_signal: GPIO_EMC_B1_34}
  - {pin_num: L1, peripheral: ECAT, signal: 'PT1_RXD, 3', pin_signal: GPIO_EMC_B1_35}
  - {pin_num: M1, peripheral: ECAT, signal: 'PT1_TXD, 3', pin_signal: GPIO_EMC_B1_36}
  - {pin_num: N1, peripheral: ECAT, signal: 'PT1_TXD, 2', pin_signal: GPIO_EMC_B1_37}
  - {pin_num: M2, peripheral: ECAT, signal: PT1_RX_CLK, pin_signal: GPIO_EMC_B1_38}
  - {pin_num: M17, peripheral: ECAT, signal: 'LINK_MII, 1', pin_signal: GPIO_AD_17, pull_keeper_select: Keeper}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Port1_MII_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Port1_MII_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 is configured as ECAT_LINK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_26_ECAT_TX_DATA1_1,  /* GPIO_EMC_B1_26 is configured as ECAT_TX_DATA1_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_27_ECAT_TX_DATA0_1,  /* GPIO_EMC_B1_27 is configured as ECAT_TX_DATA0_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_28_ECAT_TX_EN_1,     /* GPIO_EMC_B1_28 is configured as ECAT_TX_EN_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_29_ECAT_TX_CLK_1,    /* GPIO_EMC_B1_29 is configured as ECAT_TX_CLK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_30_ECAT_RX_DATA0_1,  /* GPIO_EMC_B1_30 is configured as ECAT_RX_DATA0_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_31_ECAT_RX_DATA1_1,  /* GPIO_EMC_B1_31 is configured as ECAT_RX_DATA1_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_32_ECAT_RX_DV_1,     /* GPIO_EMC_B1_32 is configured as ECAT_RX_DV_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_33_ECAT_RX_ER_1,     /* GPIO_EMC_B1_33 is configured as ECAT_RX_ER_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_34_ECAT_RX_DATA2_1,  /* GPIO_EMC_B1_34 is configured as ECAT_RX_DATA2_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_35_ECAT_RX_DATA3_1,  /* GPIO_EMC_B1_35 is configured as ECAT_RX_DATA3_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_36_ECAT_TX_DATA3_1,  /* GPIO_EMC_B1_36 is configured as ECAT_TX_DATA3_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_37_ECAT_TX_DATA2_1,  /* GPIO_EMC_B1_37 is configured as ECAT_TX_DATA2_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_38_ECAT_RX_CLK_1,    /* GPIO_EMC_B1_38 is configured as ECAT_RX_CLK_1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_17_ECAT_LINK_1,          /* GPIO_AD_17 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_ECAT_I2C_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: K16, peripheral: ECAT, signal: SCL, pin_signal: GPIO_AD_18, pull_up_down_config: Pull_Up, open_drain: Enable, slew_rate: Slow}
  - {pin_num: L13, peripheral: ECAT, signal: SDA, pin_signal: GPIO_AD_19, pull_up_down_config: Pull_Up, open_drain: Enable, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

